{
  "header": {
    "menu": "Навигация по сайту",
    "main": "Главная",
    "reason": "Почему я меняю место работы?",
    "general": "Общая информация",
    "education": "Образование и курсы",
    "experience": "Мой опыт работы",
    "skills": "Hard skills",
    "salary": "Ожидаемая зарплата",
    "contacts": "Контакты",
    "download": "Загрузить резюме"
  },
  "footer": {
    "text": "Остались вопросы?",
    "btn": "Пишите"
  },
  "form": {
    "title": "Обратная связь",
    "name": "Ваше имя ...",
    "email": "*Ваша электронная почта ...",
    "company": "Компания / ссылка на сайт ...",
    "text": "Ваше сообщение ...",
    "confirm": "Я даю согласие на обработку персональной информации",
    "submit": "Отправить",
    "success": "Ваш вопрос успешно отправлен. Я постараюсь ответить на него максимально быстро.",
    "errorMail": "Упсс.. Кажется здесь есть ошибка.",
    "errorNoMail": "Я не смогу ответить на ваш вопрос не зная вашу электронную почту.",
    "errorConfirm": "Не забудьте отметить согласие на обработку персональной информации."
  },
  "reason": {
    "title": "Почему я меняю место работы?",
    "firstText": [
      "С детства меня интересовала математика, а в особенности геометрия. Поэтому я решил, что меня ждёт успешное будущее в мире экономики и финансов. После окончания школы я начал обучаться и в дальнейшем работать в этой сфере.",
      "В скором времени я осознал, что оформление документов и презентаций для меня имеют больше смысла, чем содержание этих документов.",
      "Упуская долгий период душевных терзаний, перейду сразу к главному. Примерно два года назад я неожиданно для себя открыл мир веб-разработки."
    ],
    "secondText": [
      "Уже в конце мая 2019 года я окончательно расставил приоритеты и записался на курсы full-stack разработчика в GoIT.",
      "Взвесив все за и против, я решил как можно скорее сменить профессию чтобы получить более релевантный опыт, поэтому устроился работать на позицию junior fron-end developer заранее до окончания курсов.",
      "В результате такого решения я значительно улучшил свои знания и навыки, однако, сейчас я решил идти дальше чтобы максимально реализовать свой потенциал и в полной мере применить знания, полученные на курсах GoIT."
    ],
    "relink": "Посмотреть общую информацию обо мне"
  },
  "general": {
    "title": "Общая информация",
    "tablet": [
      ["Имя:", "Игорь", "20"],
      ["Фамилия:", "Михайличенко", "90"],
      ["Дата рождения:", "09.12.1995", "160"],
      ["Адрес:", "г. Киев, Голосеевский р-н, ул. Васильковская 4", "230"],
      ["Знание языков:", "Upper Intermediate - English language", "300"],
      [
        "Личные качества:",
        "Совмещаю креативность и аналитическое мышление, готов много учиться, ориентируюсь на результат, коммуникабельный, внимательный к деталям, пунктуальный, ответственный. Не имею вредных привычек.",
        "370"
      ]
    ],
    "text": "Soft skills: умею правильно доносити свои мысли, работать в команде, желаю получать и делиться знаниями, имею хорошее чувство юмора, но это неточно.",
    "relink": "Образование и курсы"
  },
  "education": {
    "title": "Образование и курсы",
    "item": [
      {
        "title": "Bachelor Degree",
        "text": "2013 – 2017. Киевский национальный университет имени Тараса Шевченко. Бакалавр, специальность - менеджмент.",
        "background": "#fff",
        "color": "#404040",
        "translate": "-100%",
        "y": "90deg",
        "x": "0"
      },
      {
        "title": "Manager Degree",
        "text": "2017 – 2019. Киевский национальный университет имени Тараса Шевченко. Магистр, специальность - менеджмент инновационной деятельности. Квалификация проджект менеджера.",
        "background": "#369FFF",
        "color": "#fff",
        "translate": "100%",
        "y": "-80deg",
        "x": "0"
      },
      {
        "title": "Full-stack Courses",
        "text": "2019 – 2020. GoIT / Программа подготовки Full stack – разработчиков, фокусируется на front-end: HTML/CSS, JavaScript, React.js и back-end: Node.js.",
        "background": "#FFC56D",
        "color": "#fff",
        "translate": "-100%",
        "y": "0",
        "x": "-40deg"
      }
    ],
    "relink": "Посмотреть мой опыт работы"
  },
  "experience": {
    "title": "Мой опыт работы",
    "slider": [
      {
        "linkt": "https://dl.agency/",
        "company": "DL.Agency",
        "title": "Январь 2020 г. Junior front-end developer.",
        "responsibility": "Обязанности:",
        "list": [
          "адаптивная, валидная и кроссбраузерная верстка сайтов по макету;",
          "создание сложных анимаций с помощью JavaScript и CSS;",
          "подключение новых модулей к готовым сайтам;",
          "подключение верстки к CMS (wordpress);",
          "оптимизация скорости загрузки сайтов;",
          "доработка сайтов."
        ]
      },
      {
        "linkt": "https://home.kpmg/ua/ru/home.html",
        "company": "КПМГ-Украина",
        "title": "Май 2018 г. – Октябрь 2019 г. Консультант по трансфертному ценообразованию.",
        "responsibility": "Обязанности:",
        "list": [
          "анализ внутригрупповых операций, проводимых между украинскими и зарубежными компаниями на предмет трансфертного ценообразования;",
          "проведение анализа рынка, на котором функционирует клиент (IT, сельское хозяйство, FMCG и др.);",
          "выявление рисков трансфертного ценообразования;",
          "работа с базами данных ktMINE, Ruslana, SPARK, TP Catalyst;",
          "подготовка документации по трансфертному ценообразованию;",
          "структурирование внутригрупповых операций в соответствии с украинским налоговым законодательством и международными принципами трансфертного ценообразования."
        ]
      },
      {
        "linkt": "https://www.controlpay.com/",
        "company": "ControlPay Украина",
        "title": "Февраль – Май 2018 г. Invoice auditor",
        "responsibility": "Обязанности:",
        "list": [
          "навигация и использование веб-платформы компании ControlPay и инструментов поддержки клиентов;",
          "проверка и анализ инвойсов;",
          "аудит транспортных накладных;",
          "анализ данных отгрузки грузов;",
          "проверка логики расчетов;",
          "общение с клиентами (электронная почта / конференц-связь)."
        ]
      }
    ],
    "secondTitle": "Примеры моих коммерческих работ",
    "textOne": "Ниже представлены сайты в создании которых я принимал активное участие. Это не все мои работы! Ради справедливой оценки я выделил только те сайты, которые я создавал самостоятельно либо отыгрывал мажорную роль в их создании.",
    "textTwo": "Для сравнения, ниже представлены ранние версии моих резюме. Не судите строго, это было давно.",
    "relink": "Hard skills"
  },
  "skills": {
    "title": "Hard skills",
    "text": [
      "В данном разделе я укажу основные навыки и знания, которыми я овладел при прохождении курсов GoIT, а также те, что я освоил на практике. Некоторые из указанных скилов представлены на этом сайте.",
      "Так же, вы можете посетить мою страницу на GitHub и убедиться, что все указанные навыки были пройдены мною на практике. Ссылка на GitHub профиль находится в футере сайта."
    ],
    "list": [
      {
        "title": "HTML & CSS",
        "text": "Все необходимое для того, чтобы сверстать веб-страницу на основе полученного дизайн-макета.",
        "item": [
          {
            "img": "github",
            "logoColor": "rgb(237,119,119)",
            "title": "GITHUB",
            "text": "Навыки работы с терминалом, создание репозиториев, веток и т.д."
          },
          {
            "img": "html",
            "logoColor": "rgb(237,119,119)",
            "title": "HTML 5",
            "text": "Семантическая верстка и работа со спецификацией. Создание текстовых блоков, добавление ссылок, размещение картинок и многое другое."
          },
          {
            "img": "css",
            "logoColor": "rgb(237,119,119)",
            "title": "CSS",
            "text": "Приоритетность и наследование, работа с цветами, позиционирование элементов, псевдоклассы и псевдоэлементы, CSS-фильтры и CSS-счетчики, подключение кастомных шрифтов и т.д."
          },
          {
            "img": "grid",
            "logoColor": "rgb(237,119,119)",
            "title": "Flexbox",
            "text": "Современная технология позиционирования элементов в потоке документа."
          },
          {
            "img": "responsive",
            "logoColor": "rgb(237,119,119)",
            "title": "Адаптивная и отзывчивая верстка",
            "text": "Верстка страницы под различные устройства и ширины экрана. Mobile-first CSS."
          },
          {
            "img": "brouser",
            "logoColor": "rgb(237,119,119)",
            "title": "Кроссбраузерность. Методологии верстки",
            "text": "Работа со специфичными для разных браузеров свойствами. Использование методологии именования BEM"
          },
          {
            "img": "sass",
            "logoColor": "rgb(237,119,119)",
            "title": "Автоматизация и препроцессоры",
            "text": "Автоматизация процесса верстки c Gulp. CSS-препроцессор SASS. HTML-препроцессор PUG."
          }
        ]
      },
      {
        "title": "JAVASCRIPT",
        "text": "Создание интерактивных элементов сайта и сделать его использования комфортным",
        "item": [
          {
            "img": "js",
            "logoColor": "rgb(255,197,109)",
            "title": "Основы JavaScript",
            "text": "Переменные, примитивные типы данных, основные операторы. Строки, чиcла, преобразование типов. Операторы сравнения, логические операторы. Ветвления. Циклы."
          },
          {
            "img": "array",
            "logoColor": "rgb(255,197,109)",
            "title": "Массивы",
            "text": "Массивы, элементы, индексация. Методы массивов. Деструктуризация массивов и оператор rest."
          },
          {
            "img": "func",
            "logoColor": "rgb(255,197,109)",
            "title": "Функции",
            "text": "Объявление функции и функциональные выражения. Стек вызовов. Область видимости. Псевдомассив arguments и многое другое."
          },
          {
            "img": "obj",
            "logoColor": "rgb(255,197,109)",
            "title": "Объекты",
            "text": "Свойства и методы объекта. Передача по ссылке и по значению. Перебор объектов. Слияние объектов. Деструктуризация обьектов. Контекст исполнения функции и т.д."
          },
          {
            "img": "bug",
            "logoColor": "rgb(255,197,109)",
            "title": "Отладка кода и перехват ошибок",
            "text": "Дебаггер. try/catch. throw."
          },
          {
            "img": "oop",
            "logoColor": "rgb(255,197,109)",
            "title": "Основы ООП",
            "text": "Прототип объекта. Прототипное наследование. Конструкторы. ES6 Классы."
          },
          {
            "img": "dom",
            "logoColor": "rgb(255,197,109)",
            "title": "DOM",
            "text": "Поиск, создание и добавление DOM-узлов. Оптимизация работы с DOM. BOM. Feature detection."
          },
          {
            "img": "event",
            "logoColor": "rgb(255,197,109)",
            "title": "События",
            "text": "Делегирование событий. События мыши, клавиатуры, форм, touch. Применение техник throttling и debouncing."
          },
          {
            "img": "asynchronous",
            "logoColor": "rgb(255,197,109)",
            "title": "Асинхронный JavaScript",
            "text": "Таймеры. Promise API. Протоколы передачи данных. JSON. AJAX. XHR. Fetch API. CORS. WebSockets."
          },
          {
            "img": "storage",
            "logoColor": "rgb(255,197,109)",
            "title": "Хранение данных на клиенте",
            "text": "Cookies. WebStorage. IndexedDB"
          },
          {
            "img": "auto",
            "logoColor": "rgb(255,197,109)",
            "title": "Автоматизация",
            "text": "Node.js и пакетный менеджер npm. Настройка Webpack. CommonJS и ES6 модули"
          },
          {
            "img": "other",
            "logoColor": "rgb(255,197,109)",
            "title": "Дополнительное",
            "text": "Итераторы, генераторы, async/await. Функции высшего порядка. Шаблонизаторы Handlebars, PUG и т.д."
          }
        ]
      },
      {
        "title": "REACT",
        "text": "Создание клиентской части SPA-приложения, используя React",
        "item": [
          {
            "img": "react",
            "logoColor": "rgb(54,159,255)",
            "title": "React компоненты",
            "text": "Компонентный подход, использование jsx синтаксиса, передача данных в компоненты, работа с коллекциями"
          },
          {
            "img": "css",
            "logoColor": "rgb(54,159,255)",
            "title": "Стилизация компонентов",
            "text": "Инлайн CSS, ванильный CSS или SASS, CSS-модули, CSS-in-JS"
          },
          {
            "img": "event",
            "logoColor": "rgb(54,159,255)",
            "title": "События и состояние",
            "text": "Созданием stateful компонентов, добавление интерактивности."
          },
          {
            "img": "form",
            "logoColor": "rgb(54,159,255)",
            "title": "Формы",
            "text": "Создание контролируемых элементов"
          },
          {
            "img": "asynchronous",
            "logoColor": "rgb(54,159,255)",
            "title": "Жизненный цикл",
            "text": "Переопределение поведения компонентов в рамках их жизненного цикла"
          },
          {
            "img": "route",
            "logoColor": "rgb(54,159,255)",
            "title": "React router",
            "text": "Создание и управление routing на стороне клиента. Code splitting. React.lazy, react loadable"
          },
          {
            "img": "pattern",
            "logoColor": "rgb(54,159,255)",
            "title": "Паттерны и контекст",
            "text": "Создание и использование Higher-Order Component, Render Prop, Context API"
          },
          {
            "img": "animation",
            "logoColor": "rgb(54,159,255)",
            "title": "Анимация",
            "text": "Создание анимированных компонентов в React Transition Group"
          },
          {
            "img": "redux",
            "logoColor": "rgb(54,159,255)",
            "title": "Redux",
            "text": "Использование библиотеки Redux с React, Redux Toolkit"
          },
          {
            "img": "password",
            "logoColor": "rgb(54,159,255)",
            "title": "JWT(JSON Web Token)",
            "text": "Авторизация и аутентификация пользователя"
          }
        ]
      },
      {
        "title": "OTHER",
        "text": "Остальные навыки, которые не вошли в предыдущие разделы",
        "item": [
          {
            "img": "ts",
            "logoColor": "rgb(255,255,255)",
            "title": "TypeScript",
            "text": "Навыки использование TypeScript с React"
          },
          {
            "img": "php",
            "logoColor": "rgb(255,255,255)",
            "title": "Основы php",
            "text": "Навыки работы с php, синтаксис, основные понятия, создание php шаблонов для Wordpress"
          },
          {
            "img": "wordpress",
            "logoColor": "rgb(255,255,255)",
            "title": "Wordpress",
            "text": "Использование CMS - Wordpress при создание сайтов, подвязка админ панели"
          },
          {
            "img": "jquery",
            "logoColor": "rgb(255,255,255)",
            "title": "JQuery",
            "text": "Навыки работы с библиотекой JQuery"
          }
        ]
      }
    ],
    "relink": "Оплата моего труда"
  },
  "salary": {
    "title": "Ожидаемая зарплата",
    "text": [
      "В среднем «front-end developer» в Киеве зарабатывает 34000 грн. Это медиана заработных плат по данным из 95 вакансий, размещенных на work.ua за последние 3 месяца. Также, по данным портала djinni, наибольшее количество оферов было отправлено кандидатам с ожидаемой заработной платой в диапазоне от $500 до $1000 (Cереди кандидатов с опытом работы до 1 года)",
      "Касательно портала DOU, то диапазон составлял от $1100 до $1850 для разработчиков со знанием языка прорамування javascript, однако это информация за декабрь 2019 года, что является менее релевантным показателем."
    ],
    "sale": "В связи со сложившейся ситуацией в мире, я готов сделать специальное предложение для вас. Если вы свяжитесь со мной в ближайшее время, то получите скидку в размере $200.01 на оплату моего труда",
    "before": "до - ",
    "now": "сейчас - ",
    "graphText": "Все еще сомневаетесь? Тогда заумные графики с англискими словами, представленные ниже, должны убрать все ваши сомнения",
    "captionOne": "На этом графике синяя линия отображает эффективность моей работы по сравнению с другими кандидатами, которые тоже хотят попасть к вам в компанию. Помоему, выбор очевиден",
    "captionTwo": "Если вас не убедил первый график, то посмотрите как выростет доход вашей компании после того как я устроюсь к вам работать.",
    "endText": "Надеюсь эта страница вас немного развеселила. В крайнем случае - нет. Ну и если серьезно, то мой ожидаемый уровень дохода - $1K, но в любом случае пишите, можем обсудить.",
    "relink": "Контакты"
  },
  "download": {
    "title": "Загрузить резюме",
    "text": "Как я и обещал на главной странице, здесь вы можете скачать резюме в подходящем для вас формате",
    "pdf": "Это оформленный вариант резюме в PDF формате. Одинаково выглядит на всех устройствах.",
    "doc": "Это текстовый вариант резюме в DOC формате, без оформления. На случай если вас интересует только текс.",
    "btn": "Загрузить",
    "relink": "Почему я меняю работу?"
  },
  "main": {
    "title": "Автор этой страницы ищет работу на позицию front-end разработчика",
    "text": "Если у вас нету времени ознакамливаться со всей информацией, или вам просто лень, в пункте навигации по сайту вы можете перейти в раздел для скачивания резюме.",
    "relink": "Поехали"
  },
  "contacts": {
    "title": "Контакты",
    "secondTitle": "Удобно ли мне будет добираться к вам в офис?",
    "text": "Еще ни одно мое собеседование не проходило без этого вопроса. Забегая на перед, я отвечу, что если вы находитесь в приделах 30-ти минут хотьбы от метро, то это просто супер. Если же ваш офис дальше, то меня все равно это не останавливает ¯ _(ツ)_/¯.",
    "relink": "Загрузить резюме"
  },
  "notFound": {
    "title": "404",
    "text": "Упс, что-то пошло не так и страница не была найдена",
    "relink": "Перейти на главную"
  }
}
