{
  "header": {
    "menu": "Навігація по сайту",
    "main": "Головна",
    "reason": "Чому я змінюю місце роботи?",
    "general": "Загальна інформація",
    "education": "Освіта та курси",
    "experience": "Мій досвід роботи",
    "skills": "Hard skills",
    "salary": "Очікувана зарплата",
    "contacts": "Контакти",
    "download": "Завантажити резюме"
  },
  "footer": {
    "text": "Залишилися питання?",
    "btn": "Пишіть"
  },
  "form": {
    "title": "Зворотній зв'язок",
    "name": "Ваше ім'я ...",
    "email": "*Ваша електронна пошта ...",
    "company": "Компанія / посилання на сайт ...",
    "text": "Ваше повідомлення ...",
    "confirm": "Я даю згоду на обробку персональних даних",
    "submit": "Надіслати",
    "success": "Ваше питання було успішно надіслано. Я відповім на нього за першої нагоди.",
    "errorMail": "Упсс.. Здається тут є помилка.",
    "errorNoMail": "Я не можу відповісти на ваше запитання не знаючи вашу електронну пошту.",
    "errorConfirm": "Не забудьте зазначити згоду на обробку персональних даних."
  },
  "reason": {
    "title": "Чому я змінюю місце роботи?",
    "firstText": [
      "З дитинства мене цікавила математика, а в особливості геометрія. Тому я вирішив, що мене чекає успішне майбутнє в світі економіки і фінансів. Після закінчення школи я почав навчатися й надалі працювати в цій сфері.",
      "Проте, незабаром я усвідомив, що оформлення документів і презентацій для мене мають більше сенсу, ніж зміст цих документів.",
      "Упускаючи довгий період душевних мук, перейду відразу до головного. Приблизно два роки тому я несподівано для себе відкрив світ веб-розробки."
    ],
    "secondText": [
      "Уже в кінці травня 2019 роки я остаточно розставив пріоритети і записався на курси full-stack розробника в GoIT.",
      "Зваживши всі за та проти, я вирішив якомога швидше змінити професію щоб отримати більш релевантний досвід, тому влаштувався працювати на позицію junior fron-end developer заздалегідь до закінчення курсів.",
      "У результаті такого рішення я значно поліпшив свої навики та знання, проте, зараз я вирішив йти далі щоб максимально реалізувати свій потенціал та в повній мірі застосувати знання отримані на курсах GoIT."
    ],
    "relink": "Переглянути загальну інформацію про мене"
  },
  "general": {
    "title": "Загальна інформація",
    "tablet": [
      ["Ім'я:", "Ігор", "20"],
      ["Прізвище:", "Михайличенко", "90"],
      ["Дата народження:", "09.12.1995", "160"],
      ["Адреса:", "г. Київ, Голосіївский р-н, вул. Васильківська 4", "230"],
      ["Знання мов:", "Upper Intermediate - English language", "300"],
      [
        "Особисті якості:",
        "Поєдную креативність і аналітичне мислення, готовий багато вчитися, орієнтуюся на результат, комунікабельний, уважний до деталей, пунктуальний, відповідальний. Не маю шкідливих звичок.",
        "370"
      ]
    ],
    "text": "Soft skills: вмію правильно доносити свою думку, працювати в команді, бажаю отримувати та ділитися знаннями, маю гарне почуття гумору, але це не точно.",
    "relink": "Освіта та курси"
  },
  "education": {
    "title": "Освіта та курси",
    "item": [
      {
        "title": "Bachelor Degree",
        "text": "2013 - 2017. Київський національний університет імені Тараса Шевченка. Бакалавр, спеціальність - Менеджмент.",
        "background": "#fff",
        "color": "#404040",
        "translate": "-180%",
        "y": "90deg",
        "x": "0"
      },
      {
        "title": "Manager Degree",
        "text": "2017 - 2019. Київський національний університет імені Тараса Шевченка. Магістр, спеціальність - Менеджмент інноваційної діяльності. Кваліфікація проджект менеджера.",
        "background": "#369FFF",
        "color": "#fff",
        "translate": "180%",
        "y": "-80deg",
        "x": "0"
      },
      {
        "title": "Full-stack Courses",
        "text": "2019 - 2020. GoIT / Програма підготовки full-stack розробників, фокусується на front-end: HTML / CSS, JavaScript, React.js і back-end: Node.js.",
        "background": "#FFC56D",
        "color": "#fff",
        "translate": "-180%",
        "y": "0",
        "x": "20deg"
      }
    ],
    "relink": "Подивитися мій досвід роботи"
  },
  "experience": {
    "title": "Мій досвід роботи",
    "slider": [
      {
        "linkt": "https://dl.agency/uk/",
        "company": "DL.Agency",
        "title": "Cічень 2020 р. Junior front-end developer.",
        "responsibility": "Обов'язки:",
        "list": [
          "адаптивна, валідна і кросбраузерна верстка сайтів по макету;",
          "створення складних анімацій за допомогою JavaScript і CSS;",
          "підключення нових модулів до готових сайтів;",
          "підключення верстки до CMS (wordpress);",
          "оптимізація швидкості завантаження сайтів;",
          "доопрацювання сайтів."
        ]
      },
      {
        "linkt": "https://home.kpmg/ua/uk/home.html",
        "company": "КПМГ-Україна",
        "title": "Май 2018 р. - Жовтень 2019 р. Консультант з трансфертного ціноутворення.",
        "responsibility": "Обов'язки:",
        "list": [
          "аналіз внутрішньогрупових операцій, що проводяться між українськими і зарубіжними компаніями на предмет трансфертного ціноутворення;",
          "проведення аналізу ринку, на якому функціонує клієнт (IT, сільське господарство, FMCG і ін.);",
          "виявлення ризиків трансфертного ціноутворення;",
          "робота з базами даних ktMINE, Ruslana, SPARK, TP Catalyst;",
          "підготовка документації з трансфертного ціноутворення;",
          "структурування внутрішньогрупових операцій відповідно до українського податкового законодавства і міжнародними принципами трансфертного ціноутворення. "
        ]
      },
      {
        "linkt": "https://www.controlpay.com/",
        "company": "ControlPay Україна",
        "title": "Лютий - Май 2018 р. Invoice auditor",
        "responsibility": "Обов'язки:",
        "list": [
          "навігація і використання веб-платформи компанії ControlPay та інструментів підтримки клієнтів;",
          "перевірка і аналіз інвойсів;",
          "аудит транспортних накладних;",
          "аналіз даних відвантаження;",
          "перевірка логіки розрахунків;",
          "спілкування з клієнтами (електронна пошта / конференц-зв'язок)."
        ]
      }
    ],
    "secondTitle": "Приклади моїх комерційних робіт",
    "textOne": "Нижче представлені сайти в створенні яких я брав активну участь. Це не всі мої роботи! Заради справедливої оцінки я виділив лише ті сайти, які я створював самостійно або відігравав мажорну роль в їх створенні.",
    "textTwo": "Для порівняння, нижче представлені ранні версії моїх резюме. Не судіть суворо, це було дуже давно.",
    "relink": "Hard skills"
  },
  "skills": {
    "title": "Hard skills",
    "text": [
      "В даному розділі я вкажу основні навички та знання, які я опанував при проходженні курсів GoIT, а також ті, що я освоїв на практиці. Деякі із зазначених скілів представлені на цьому сайті.",
      "Також, ви можете відвідати мою сторінку на GitHub і переконатися, що всі зазначені навички були пройдені мною на практиці. Посилання на GitHub профіль знаходится у футере сайту."
    ],
    "list": [
      {
        "title": "HTML & CSS",
        "text": "Все необхідне для того, щоб зверстати веб-сторінку на основі отриманого дизайн-макету.",
        "item": [
          {
            "img": "github",
            "logoColor": "rgb(237,119,119)",
            "title": "GITHUB",
            "text": "Навички роботи з терміналом, створення репозитаріїв, гілок і т.д."
          },
          {
            "img": "html",
            "logoColor": "rgb(237,119,119)",
            "title": "HTML 5",
            "text": "Семантична верстка і робота зі специфікацією. Створення текстових блоків, додавання посилань, розміщення картинок і багато іншого."
          },
          {
            "img": "css",
            "logoColor": "rgb(237,119,119)",
            "title": "CSS",
            "text": "Пріоритетність і наслідування, робота з кольорами, позиціонування елементів, псевдокласи і псевдоелементи, підключення кастомних шрифтів і т.д."
          },
          {
            "img": "grid",
            "logoColor": "rgb(237,119,119)",
            "title": "Flexbox",
            "text": "Сучасна технологія позиціонування елементів в потоці документа."
          },
          {
            "img": "responsive",
            "logoColor": "rgb(237,119,119)",
            "title": "Адаптивна і респонсивна верстка",
            "text": "Верстка сторінки під різні пристрої і розміри екрану. Mobile-first CSS."
          },
          {
            "img": "brouser",
            "logoColor": "rgb(237,119,119)",
            "title": "Кросбраузерність. Методології верстки",
            "text": "Робота зі специфічними для різних браузерів властивостями. Використання методології іменування BEM"
          },
          {
            "img": "sass",
            "logoColor": "rgb(237,119,119)",
            "title": "Автоматизація та препроцесори",
            "text": "Автоматизація процесу верстки з Gulp. CSS-препроцесор SASS. HTML-препроцесор PUG."
          }
        ]
      },
      {
        "title": "JAVASCRIPT",
        "text": "Створення інтерактивних елементів сайту і зробити його використання комфортним",
        "item": [
          {
            "img": "js",
            "logoColor": "rgb(255,197,109)",
            "title": "Основи JavaScript",
            "text": "Змінні, примітивні типи даних, основні оператори. Рядки, чиcла, перетворення типів. Оператори порівняння, логічні оператори. Розгалуження. Цикли."
          },
          {
            "img": "array",
            "logoColor": "rgb(255,197,109)",
            "title": "Масиви",
            "text": "Масиви, елементи, індексація. Методи масивів. Деструктуризація масивів і оператор rest."
          },
          {
            "img": "func",
            "logoColor": "rgb(255,197,109)",
            "title": "Функції",
            "text": "Оголошення функцій і функціональні вирази. Стек викликів. Область видимості. Псевдомасиви arguments і т.д."
          },
          {
            "img": "obj",
            "logoColor": "rgb(255,197,109)",
            "title": "Об'єкти",
            "text": "Властивості та методи об'єкта. Передача по посиланню і за значенням. Перебір об'єктів. Злиття об'єктів. Деструктуризація обьектов. Контекст виконання функції і т.д."
          },
          {
            "img": "bug",
            "logoColor": "rgb(255,197,109)",
            "title": "Налагодження коду і перехоплення помилок",
            "text": "Дебаггер. try/catch. throw."
          },
          {
            "img": "oop",
            "logoColor": "rgb(255,197,109)",
            "title": "Основи ООП",
            "text": "Прототип об'єкта. Прототипне наслідування. Конструктори. ES6 Класи."
          },
          {
            "img": "dom",
            "logoColor": "rgb(255,197,109)",
            "title": "DOM",
            "text": "Пошук, створення і додавання DOM-вузлів. Оптимізація роботи з DOM. BOM. Feature detection."
          },
          {
            "img": "event",
            "logoColor": "rgb(255,197,109)",
            "title": "Події",
            "text": "Делегування подій. Події миші, клавіатури, форм, touch. Застосування технік throttling і debouncing."
          },
          {
            "img": "asynchronous",
            "logoColor": "rgb(255,197,109)",
            "title": "Асинхронний JavaScript",
            "text": "Таймери. Promise API. Протоколи передачі даних. JSON. AJAX. XHR. Fetch API. CORS. WebSockets."
          },
          {
            "img": "storage",
            "logoColor": "rgb(255,197,109)",
            "title": "Зберігання даних на клієнті",
            "text": "Cookies. WebStorage. IndexedDB"
          },
          {
            "img": "auto",
            "logoColor": "rgb(255,197,109)",
            "title": "Автоматизація",
            "text": "Node.js і пакетний менеджер npm. Налаштування Webpack. CommonJS і ES6 модулі"
          },
          {
            "img": "other",
            "logoColor": "rgb(255,197,109)",
            "title": "Додаткове",
            "text": "Ітератори, генератори, async / await. Функції вищого порядку. Шаблонизатор Handlebars, PUG і т.д."
          }
        ]
      },
      {
        "title": "REACT",
        "text": "Створення клієнтської частини SPA-додатки, використовуючи React",
        "item": [
          {
            "img": "react",
            "logoColor": "rgb(54,159,255)",
            "title": "React компоненти",
            "text": "Компонентний підхід, використання jsx синтаксису, передача даних в компоненти, робота з колекціями"
          },
          {
            "img": "css",
            "logoColor": "rgb(54,159,255)",
            "title": "Стилізація компонентів",
            "text": "Инлайн CSS, ванильный CSS или SASS, CSS-модули, CSS-in-JS"
          },
          {
            "img": "event",
            "logoColor": "rgb(54,159,255)",
            "title": "Події та стан",
            "text": "Створенням stateful компонентів, додавання інтерактивності."
          },
          {
            "img": "form",
            "logoColor": "rgb(54,159,255)",
            "title": "Форми",
            "text": "Створення контрольованих елементів"
          },
          {
            "img": "asynchronous",
            "logoColor": "rgb(54,159,255)",
            "title": "Життєвий цикл",
            "text": "Перевизначення поведінки компонентів у рамках їх життєвого циклу"
          },
          {
            "img": "route",
            "logoColor": "rgb(54,159,255)",
            "title": "React router",
            "text": "Створення та управління routing на стороні клієнта. Code splitting. React.lazy, react loadable"
          },
          {
            "img": "pattern",
            "logoColor": "rgb(54,159,255)",
            "title": "Паттерни і контекст",
            "text": "Створення і використання Higher-Order Component, Render Prop, Context API"
          },
          {
            "img": "animation",
            "logoColor": "rgb(54,159,255)",
            "title": "Анімація",
            "text": "Створення анімованих компонентів в React Transition Group"
          },
          {
            "img": "redux",
            "logoColor": "rgb(54,159,255)",
            "title": "Redux",
            "text": "Використання бібліотеки Redux з React, Redux Toolkit"
          },
          {
            "img": "password",
            "logoColor": "rgb(54,159,255)",
            "title": "JWT(JSON Web Token)",
            "text": "Авторизація та аутентифікація користувача"
          }
        ]
      },
      {
        "title": "OTHER",
        "text": "Решта навиків, які не ввійшли в попередні розділи",
        "item": [
          {
            "img": "ts",
            "logoColor": "rgb(255,255,255)",
            "title": "TypeScript",
            "text": "Навички використання TypeScript з React "
          },
          {
            "img": "php",
            "logoColor": "rgb(255,255,255)",
            "title": "Основи php",
            "text": "Навички роботи з php, синтаксис, основні поняття, створення php шаблонів для Wordpress"
          },
          {
            "img": "wordpress",
            "logoColor": "rgb(255,255,255)",
            "title": "Wordpress",
            "text": "Використання CMS - Wordpress при створення сайтів, підв'язка адмін панелі"
          },
          {
            "img": "jquery",
            "logoColor": "rgb(255,255,255)",
            "title": "JQuery",
            "text": "Навички роботи з бібліотекою JQuery"
          }
        ]
      }
    ],
    "relink": "Оплата моєї праці"
  },
  "salary": {
    "title": "Очікувана зарплата",
    "text": [
      "В середньому «front-end developer» у Києві заробляє 34000 грн. Це медіана заробітних плат за даними з 95 вакансій, розміщених на work.ua за останні 3 місяці. Також, за данними порталу djinni, найбільшу кількість оферів було надіслано кандидатам із очікуваною заробітною платою в діапазоні від $500 до $1000 (cеред кандидатів із досвідом роботи до 1 року)",
      "Щодо порталу DOU, то діапазон становить від $1100 до $1850 для розробників зі знанням мови прорамування javascript, проте наявна інформація лише за грудень 2019 року, що є менш релевантним показником."
    ],
    "sale": "У зв'язку зі сформованою ситуацією у світі, я готовий зробити спеціальну пропозицію для вас. Якщо ви зв'яжитесь зі мною найближчим часом, то отримаєте знижку в розмірі $200.01 на оплату моєї праці",
    "before": "до - ",
    "now": "зараз - ",
    "graphText": "Все ще вагаєтесь? Тоді графіки з англомовними словами, представлені нижче, повинні ліквідувати всі ваші сумніви",
    "captionOne": "На цьому графіку синя лінія відображає ефективність моєї роботи в порівнянні з іншими кандидатами, які теж бажають потрапити до вас в компанію. По-моєму, вибір очевидний",
    "captionTwo": "Якщо вас не переконав перший графік, то подивіться як зросте дохід вашої компанії після того, як я влаштуюся до вас працювати.",
    "endText": "Сподіваюся ця сторінка вас трохи розвеселила. В крайньому випадку - ні. Ну і якщо серйозно, то мій очікуваний рівень доходу - $1K, але у будь-якому випадку пишіть, можемо обговорити це.",
    "relink": "Контакти"
  },
  "download": {
    "title": "Завантажити резюме",
    "text": "Як я і обіцяв на головній сторінці, тут ви можете завантажити резюме в потрібному для вас форматі",
    "pdf": "Це оформлений варіант резюме в PDF форматі. Однаково виглядає на всіх пристроях.",
    "doc": "Це текстовий варіант резюме в DOC форматі, без оформлення. На випадок якщо вас цікавить тільки текс.",
    "btn": "Завантажити",
    "relink": "Чому я міняю роботу?"
  },
  "main": {
    "title": "Автор цієї сторінки шукає роботу на позицію front-end розробника",
    "text": "Якщо у вас немає часу ознайомлюватися з усією інформацією, або вам просто лінь, в пункті навігації по сайту ви можете перейти в розділ для скачування резюме.",
    "relink": "Поїхали"
  },
  "contacts": {
    "title": "контакти",
    "secondTitle": "Чи зручно мені буде добиратися до вас в офіс?",
    "text": "Ще жодна моя співбесіда не проходило без цього питання. Забігаючи на перед відповім, що якщо ви перебуваєте в межах 30-ти хвилин ходьби від метро, то це просто супер. Якщо ж ваш офіс далі, то мене все одно це не зупиняє ¯ _(ツ)_/¯.",
    "relink": "Завантажити резюме"
  },
  "notFound": {
    "title": "404",
    "text": "Упс, щось пішло не так і сторінка не була знайдена",
    "relink": "Перейти на головну"
  }
}
